embassy-rs/nrf-pac/svd/nrf54l05-app.svd
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEPRESENT</name>
              <description>Write '1' to disable interrupt for event CTEPRESENT</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR11</name>
          <description>Disable interrupt</description>
          <addressOffset>0x4B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLLREADY</name>
              <description>Write '1' to disable interrupt for event PLLREADY</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXADDRESS</name>
              <description>Write '1' to disable interrupt for event RXADDRESS</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXDATADMAEND</name>
              <description>Write '1' to disable interrupt for event AUXDATADMAEND</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSTONESEND</name>
              <description>Write '1' to disable interrupt for event CSTONESEND</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Data rate and modulation</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nrf_1Mbit</name>
                  <description>1 Mbps Nordic proprietary radio mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_2Mbit</name>
                  <description>2 Mbps Nordic proprietary radio mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_1Mbit</name>
                  <description>1 Mbps BLE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_2Mbit</name>
                  <description>2 Mbps BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_LR125Kbit</name>
                  <description>Long range 125 kbps TX, 125 kbps and 500 kbps RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_LR500Kbit</name>
                  <description>Long range 500 kbps TX, 125 kbps and 500 kbps RX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_4Mbit_0BT6</name>
                  <description>4 Mbps Nordic proprietary radio mode (BT=0.6/h=0.5)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_4Mbit_0BT4</name>
                  <description>4 Mbps Nordic proprietary radio mode (BT=0.4/h=0.5)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154_250Kbit</name>
                  <description>IEEE 802.15.4-2006 250 kbps</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYENDTXDELAY</name>
          <description>Configurable delay of PHYEND event for TX</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000421</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RATE4M</name>
              <description>For modes with 4 Mbps on-air bit rate, unit is 2 bit periods (Nrf_4Mbit0_5 and Nrf_4Mbit0_25 modes)</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>RATE2M</name>
              <description>For modes with 2 Mbps on-air bit rate, unit is 1 bit period (Nrf_2Mbit, Ble_2Mbit, and Ieee802154_250Kbit modes)</description>
              <lsb>4</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RATE1M</name>
              <description>For modes with 1 Mbps on-air bit rate, unit is 1/2 bit period (Nrf_1Mbit, Ble_1Mbit, Ble_LR125Kbit, and Ble_LR500Kbit modes)</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>RATE250K</name>
              <description>For modes with 250 kbps on-air bit rate, unit is 1/8 bit period (Nrf_250Kbit mode)</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state</description>
          <addressOffset>0x520</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RADIO is in the DISABLED state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>RADIO is in the RXRU state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>RADIO is in the RXIDLE state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>RADIO is in the RX state</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>RADIO is in the RXDISABLE state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>RADIO is in the TXRU state</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>RADIO is in the TXIDLE state</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>RADIO is in the TX state</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>RADIO is in the TXDISABLE state</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCTRL</name>
          <description>IEEE 802.15.4 energy detect control</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDCNT</name>
              <description>IEEE 802.15.4 energy detect loop count</description>
              <lsb>0</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>EDPERIOD</name>
              <description>IEEE 802.15.4 energy detect period, 4us resolution, no averaging except the IEEE 802.15.4 ED range 128us (32)</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Unspecified</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDSAMPLE</name>
          <description>IEEE 802.15.4 energy detect level</description>
          <addressOffset>0x534</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDLVL</name>
              <description>IEEE 802.15.4 energy detect level</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCACTRL</name>
          <description>IEEE 802.15.4 clear channel assessment control</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x052D0000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CCAMODE</name>
              <description>CCA mode of operation</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EdMode</name>
                  <description>Energy above threshold</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierMode</name>
                  <description>Carrier seen</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierAndEdMode</name>
                  <description>Energy above threshold AND carrier seen</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierOrEdMode</name>
                  <description>Energy above threshold OR carrier seen</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EdModeTest1</name>
                  <description>Energy above threshold test mode that will abort when first ED measurement over threshold is seen. No averaging.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCAEDTHRES</name>
              <description>CCA energy busy threshold. Used in all the CCA modes except CarrierMode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>CCACORRTHRES</name>
              <description>CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and CarrierOrEdMode.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>CCACORRCNT</name>
              <description>Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect is enabled.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAWHITE</name>
          <description>Data whitening configuration</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00890040</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IV</name>
              <description>Whitening initial value</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>POLY</name>
              <description>Whitening polynomial</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>AUXDATA</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_AUXDATA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x548</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CNF[%s]</name>
            <description>Description collection: AUXDATA configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACQMODE</name>
                <description>Acquisition mode (data from RADIO written to memory)</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Rtt</name>
                    <description>Baseband Channel Sounding RTT Data</description>
                    <value>0x07</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIR</name>
                <description>Data acquisition or injection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Acq</name>
                    <description>Peripheral to memory</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Inj</name>
                    <description>Memory to peripheral</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>AUXDATADMA[%s]</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_AUXDATADMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x550</addressOffset>
          <register>
            <name>ENABLE</name>
            <description>Description cluster: Enable or disable data acquisition</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable data acquisition</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Data acquisition is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Data acquisition is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PTR</name>
            <description>Description cluster: DMA pointer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Description cluster: Maximum number of 32-bit words to transfer</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of 32-bit words to transfer</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Description cluster: Number of 32-bit words transferred in the last transaction</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of 32-bit words transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
        </cluster>
